app/views/users/show.html.erb


<% if @user.codeposts.any? %>
---
SELECT  1 AS one FROM "codeposts" WHERE "codeposts"."user_id" = $1 LIMIT $2  [["user_id", 980190966], ["LIMIT", 1]]