app/views/shared/_user_info.html.erb

SELECT COUNT(*) FROM "codeposts" WHERE "codeposts"."user_id" = $1  [["user_id", 980190966]]
---
<span><%= link_to "view my profile", current_user %></span>
<span><%= pluralize(current_user.codeposts.count, "codeposts") %></span>