app/controllers/codeposts_controller.rb

SELECT "codeposts".* FROM "codeposts" ORDER BY "codeposts"."created_at" DESC
---
  def index
    @codeposts = Codepost.all

SELECT  "codeposts".* FROM "codeposts" WHERE "codeposts"."id" = $1 ORDER BY "codeposts"."created_at" DESC LIMIT $2  [["id", 980190965], ["LIMIT", 1]]
---
  def show
    @codepost = Codepost.find(params[:id])

INSERT INTO "codeposts" ("title", "html", "css", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Test post"], ["html", "<button>"], ["css", "width: 50px"], ["user_id", 980190966], ["created_at", 2016-10-25 04:40:03 UTC], ["updated_at", 2016-10-25 04:40:03 UTC]]
---
  def create
    @codepost = current_user.codeposts.build(codepost_params)
    if @codepost.save

DELETE FROM "codeposts" WHERE "codeposts"."id" = $1  [["id", 980190964]]
---
  def destroy
    @codepost.destroy