app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "html", "css", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Test"], ["html", "<button>"], ["css", "width:50px"], ["created_at", 2016-10-25 01:58:47 UTC], ["updated_at", 2016-10-25 01:58:47 UTC]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save