app/controllers/static_pages_controller.rb

SELECT  "codeposts".* FROM "codeposts" WHERE (user_id = 980190966) ORDER BY "codeposts"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "codeposts" WHERE "codeposts"."user_id" = $1  [["user_id", 980190966]]
---
  def home
    if logged_in?
      @codepost  = current_user.codeposts.build
      @feed_items = current_user.feed.paginate(page: params[:page])