app/controllers/users_controller.rb

  def show
    @count = User.count
    @user = User.find(params[:id])
    @codeposts = @user.codeposts.paginate(page: params[:page])
---
SELECT COUNT(*) FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "codeposts".* FROM "codeposts" WHERE "codeposts"."user_id" = $1 ORDER BY "codeposts"."created_at" DESC LIMIT $2 OFFSET $3  [["user_id", 980190966], ["LIMIT", 30], ["OFFSET", 0]]
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT COUNT(*) FROM "codeposts" WHERE "codeposts"."user_id" = $1  [["user_id", 980190966]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def destroy
    log_out
    current_user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 980190965]]